[{},{"name":"Battery drain","tag":"android, droid","id":"dd1","description":"Numerous users have reported problems with the battery life of their devices. One of the easiest ways to prolong your smartphone's battery is to change your locations and brightness settings.","body":"Enter the settings menu, click on Location, and select battery saving mode. As for brightness, you should avoid using auto-brightness and instead turn your screen down somewhere below halfway, or to a level that is acceptable for your eyes.\nSome phones, such as the Galaxy S5, even include extra battery saving modes."},{"name":"Frozen and slow user interface","tag":"android, droid","id":"dd2","description":"Phones typically begin to slow down as their internal storage fills up. Try deleting unused apps and photos, or moving them to the cloud or a microSD card. In addition, you should close open apps that you are no longer using, delete app cache, and limit the use of live wallpapers.","body":"An app's cached data can be deleted be going to Settings, clicking on Apps, selecting a certain app, and choosing the \"Clear cache\" option. Programs such as App Cache Cleaner and Clean Master, both of which are available for free from the Google Play store, can also be used to automate the process of clearing cache"},{"name":"Connectivity issues","tag":"android, droid","id":"dd3","description":"If you have are having a problem connecting to Bluetooth, Wi-Fi, or your cellular network, enable Airplane mode for 30 seconds, toggle it off, and try connecting again. Sometimes simply toggling the specific connection can also solve the problem.","body":"Still having issues? Try repairing or setting up your Bluetooth device or Wi-Fi network again."},{"name":"Stalled text messages","tag":"android, droid","id":"dd4","description":"Ensure you are connected to the Internet either through Wi-Fi or cellular, click on the unsent message, and click the \"resend\" option.","body":"If the problem continues, try restarting your device or even installing a third-party messaging app."},{"name":"Syncing error","tag":"android, droid","id":"dd5","description":"There are numerous steps you can take to address problems with syncing. First, ensure that you are connected to the Internet, and that the service you are trying to sync with, such as Google or Dropbox, isn't down. Double check that your password is correct and try syncing again.","body":"Still having problems? Remove the account from your device and add it again"},{"name":"App crashes","tag":"android, droid","id":"dd6","description":"Apps can crash for all sorts of reasons. Is there an update available for either the app or your phone? If so, install it.","body":"If not, force close the app by swiping it away in the multitask menu (pictured above) and then reopen it."}]