[{},{"body":"STEPS:\no Go to Menu >> Settings>> Accounts and Sync\no Identify the application with issue\no Remove from your accounts to manage\no Reboot/restart your Android Device\no Go back to Menu >> Settings>> Accounts and Sync\no Add the account\no Attempt to sync (use the “sync all” button if needed)\n* SMS Error Cause Code 97 Class 2\nThis error pops up while sending SMS. Users are usually not aware that this error could be possibly due to text plan or lack of it. While activating your number, you may be required to call an automated number. Please follow instructions carefully or your SMS service might be disrupted even after few months.\n* Data Call Failure- Error code 128\nYou encounter this error often if your cellular service provider is trying to push new software down to your phone. You might be able to get rid of this error simply by updating your profile and setting web browser setting to default. In order to find the updates trying to push their way through your device, you can follow these simple steps:\nGo to settings>> System Updates >> Check status of updates (uninstalled apps are likely to be the source of problem.)\n* “Installation Unsuccessful Error” in GooglePlay\nOne of the most common errors is “Download Unsuccessful” or “Installation Unsuccessful” while you are trying to update or download app from Google Play.\nHere is how you can fix this problem:\nClear Cache(Applications > Manage Applications > All > GooglePlay and hit “Clear Data”\nIn most cases this will solve the problem. If not, you are very likely facing an SD card issue.\nYou can follow these simple steps:\nUnmount SD Card >> Uninstall Play Store Updates (Settings > Applications > All > PlayStore and hitting “Uninstall Updates”)\n* Battery Drain\nBattery woes seem to be a never ending saga for Android. No matter which version you are using Android OS simply is a battery hog.  It gets worst with services like Bluetooth, Wi-Fi and GPS. These services drain out your battery quicker than you can probably imagine. So make sure that you turn off such services when not in use. Some other ways to beat the battery drain is by disabling auto-updation of apps, adjusting brightness level of your screen, and deleting unnecessary apps.\n* Crashes\nFrequent crashes having become synonymous with Android. It is annoying to helplessly watch your mobile reboot or freeze while you are just in the middle of sending a text, about to disconnect a call, or closing an app. In order to solve this problem, you simply need to check whether RAM has enough space. Just delete the clutter such as unwanted apps or images. You can also remove apps that not compatible with current version of your OS.  This will solve problem to a great extent.","name":"syncing error","description":"This is one of the most frequent errors you will get while trying to sync your Android Device. Its solution is somewhat similar to fixing syncing for most Windows devices. First, remove the account information from device, reboot/restart, and re-enter the information back into  device. Try to download our messages/sync the device."}]