[{},{"body":"Potential solutions:\n* Some people found that the issue disappeared after they updated to the latest software. Go to Settings > More > About device > Software update and tap Update.\n* You should also make sure your apps are up to date by loading up the Play Store and going to My apps then choosing Update all.\n* It could be an app that’s causing your issues. Try holding down the Power button and choose Power off, then hold it down to turn the phone back on. When you see the Galaxy S4 logo let go of the Power button and hold the volume down key and it should boot into Safe mode. It will actually say “Safe mode” at the bottom left of the screen if it worked. If your problem is gone then it’s a safe bet that one of the apps you installed is causing it. You can try uninstalling one by one, or you can go for a factory reset and reinstall apps one by one until you find what’s responsible.\n* A lot of problems with the S4 seem to be related to memory cards. If you’ve got a MicroSD card in there then try removing it and see if the random reboots still occur.","name":"RANDOM REBOOTING","description":"An alarming number of Galaxy S4 owners have complained about a random rebooting problem. The S4 will restart itself from time to time without any obvious trigger. There are a few possible causes of this. If it happens to you, and it’s not preceded by a specific action or app, then here are some things worth trying."},{"body":"Possible solutions:\n1. You can buy a MicroSD card, up to 64GB, and you can use cloud storage solutions like Google Drive and Dropbox.\n2. The problem is that some apps can’t be installed to a MicroSD card, and they obviously can’t be run from the cloud. Your other option is to root your S4 and get rid of some of the bloatware.\nGLITCH: CAMERA AND GALLERY APP NOT WORKING\nThere are many reports of strange behaviors with the camera app and the gallery app. Some people find that one or both apps either won’t load up or sometimes crash randomly. There are also reports of the camera refusing to take pictures and the gallery app not displaying all the photos properly.\nPotential solutions:\n* Try going to Settings >More > Application manager > All and then go into the offending Camera or Gallery app and try Clear cache and Clear data. If it’s still running you may also want to Force stop it.\n* You can also try wiping the cache partition. Turn the S4 off and then press and hold Volume up, Home, and Power together. When the phone vibrates, let go of Power. When the Android Recovery screen appears let go of Volume up and Home. Use Volume down to highlight wipe cache partition and then tap the Power key to select it. It should automatically restart after wiping it.\n* Some people think this issue is related to MicroSD cards. If you are currently saving your photos to a MicroSD card, try removing it and saving them on the device or using Google+ or Dropbox to automatically back them up online.\n* Some S4 owners reported success by installing a third-party camera app, even if they subsequently remove it.\n* If the camera app refuses to load at all, or loads and then immediately fails, try restarting your S4. Make sure that the battery is fully charged. Check if it works in safe mode by turning your S4 off and then hold down the Power key until you see the S4 logo, let go of it and hold down the Volume down key until it boots (it will say Safe mode in the bottom left corner).\n* There’s an outside chance the camera problem is a hardware issue, either with the camera module or perhaps just a loose connection. If you’re under warranty then take it to a service center and find out.\nBUG: DISPLAY SMEARING OR GHOSTING\nA number of S4 owners have experienced a smearing or ghosting issue when they are scrolling in menus with a black background. Some report a purple haze on the grey bits of the menu and elsewhere. The effect is more noticeable when the brightness is turned down. Some people have also reported a red tint on black.\nPossible solution: Samsung has reportedly already released an OTA update that fixes the red tint on black, but the smearing issue has not been solved. Some people argue that it’s a limitation of the hardware; others are claiming it will be fixed via a software update.\nWorkaround: It might be worth trying the free Screen Adjuster app, as it allows you to calibrate colors and contrast.","name":"LACK OF STORAGE","description":"If you bought a 16GB Galaxy S4, you might be disappointed to find that you only have around 8.5GB free. The operating system and the preloaded apps are taking up over 6GB of the available space."},{"body":"Potential solutions:\n* Turn the S4 off and remove the SIM card. Make sure that it’s clean and try putting it back in.\n* If you have another SIM card that you can test, try that. If it works then you just need to get a new SIM card from your carrier. If it doesn’t work then there could be a hardware fault and you should take the handset back and get a replacement.","name":"SIM CARD NOT INSERTED","description":"This isn’t uncommon among smartphones. You might find that you don’t have service, or you might get a message saying “SIM card removed. The mobile network will be unavailable until you restart with a valid SIM card.”"},{"body":"Possible solutions:\n1. Go to Settings > Developer options and scroll down. Try changing Window animation scale, Transition animation scale, and Animator duration scale to Animation is off. If you don’t see Developer options then you can unlock it by going to Settings > More > About device and tapping the Build number several times (you should get a pop-up message when developer options is unlocked).\n2. Go to Settings >My device > Lock screen and then tap Unlock effect and change it to None.\n3. Fire up S-Voice and go into Settings and then uncheck the box next to Open via the home key. Be aware that this will disable the double tap activation for S-Voice, but it will also eliminate the Home button lag.","name":"LAG OR STUTTER","description":"Many people have found that the S4 stutters out of the box. There are reports of stuttering on entering and exiting apps, some lag on unlocking, and also lag when pressing the Home button. You can reasonably expect a smartphone this powerful to be as smooth as silk. If it isn’t then you can try the following:"},{"body":"If you find that your battery juice is draining fast under light usage, and the phone isn’t overheating, then there are a couple of things you could try. Start by going to Settings > More > Battery and find out what is eating the power.\nWorkarounds:\n1. Disable feature you aren’t using: Wi-Fi, GPS, Mobile data, Air view, NFC, etc.\n2. Turn on Power saving mode via the extra Quick settings in the Notifications bar.\n3. Reduce your screen brightness and timeout.\n4. Use a dark wallpaper.\n5. Watch out for apps that are constantly syncing. You’ll find options to set the sync duration in the settings menu of most apps like Facebook, which can be a drain on power.","name":"BATTERY DRAIN","description":"Is your battery draining faster than expected? Any smartphone is going to eat up a lot of juice if you use it a lot, but if you’re experiencing heavy battery drain it could be linked to the overheating problem discussed above. The hotter your battery gets, the faster it’s going to drain. You could use an app to check the temperature and make sure that’s not the real reason for the excessive battery drain."},{"body":"Possible solutions:\n1. It could be a rogue app. Make sure you have the latest updates for all your apps. Fire up the Play Store, tap Menu then My apps, and you should see available Updates at the top right. If you have an up to date app that always seems to cause the problem, then try to find an alternative.\n2. Some people report that media server could be the culprit. Try removing the MicroSD card and backing up all the files onto your computer. Reinsert the card into your S4 and format it. This might solve the problem.\n3. If it is a software problem then an update might solve it. There are reports that Sprint S4 handsets have already received an OTA (over the air) update, but we don’t know what it was for. In any case this solution means waiting.\n4. If your S4 continues to heat up,and you aren’t using it heavily, then it’s possible you have a hardware problem. Contact your retailer, carrier, or Samsung to report the problem and see if you can get a replacement.","name":"OVERHEATING","description":"A lot of people have reported that the S4 is getting very warm or even hot at times. Most people are experiencing this during movie playback or while gaming. Some had a problem with random apps, during calls, while browsing the web, or while using the camera. A few have experienced an issue while charging. Any smartphone is going to heat up with extensive use and hot weather will have an impact too."},{"body":"If you find that other devices are connecting to your router without a problem then it looks like you have an issue. Try the following:\nWorkarounds: Most people report that toggling the Wi-Fi switch in quick settings, or turning your smartphone and/or router off and on again, temporarily solves the issue.\nPotential solutions:\n1. Go into Settings > Connections and tap Wi-Fi. Then tap Menu and make sure Keep Wi-Fi on during sleep is set to Always.\n2. You can try turning off Wi-Fi power save mode on your S4. On the phone dialer type *#0011# then Menu > Wi-Fi and turn Wi-Fi power save mode to Off.\n3. Make sure that your router firmware is up to date.\n4. Change your router settings, maybe change the 802.11 mode or channel. You should refer to troubleshooting documentation for your specific router, or contact your ISP to find out how.","name":"CAN’T CONNECT TO WI-FI, IT’S VERY SLOW, OR KEEPS DROPPING CONNECTION","description":"A lot of people run into issues with their smartphones and routers. Quite a few S4 owners have reported their Wi-Fi connection dropping frequently, and a few are unable to connect at all. The problem with Wi-Fi issues is that they could be down to the hardware (mobile device or router), or they could be caused by the software (on the mobile device or the router), or they could be caused by settings (on the smartphone or the router). To complicate things further, software problems could be down to Google’s Android or Samsung’s TouchWiz overlay."}]