[{},{"body":"","name":"IOS 9 INSTALLATION PROBLEMS?","description":"The iOS 9 release date was plagued with widespread installation problems. Apple’s servers were slammed with requests and that caused them to meltdown under the pressure. Fortunately, those problems dissipated after 30 minutes or so. We’re still seeing isolated installation issues including frozen downloads and an issue that’s preventing users from swiping to update after installing the iOS 9 update on iPhone and iPad. Neither is ideal. Fortunately, there are fixes for both of these issues. If your iOS 9.2 download or installation locks up, you’ll want to hold down the power button and the home button for 10 seconds. This typically jumpstarts the process."},{"body":"If your screen stops responding to touches and swipes, you’ll want to hold down the power button and home button at the same time. Wait for the phone to reboot and then try to use your screen like you normally do. If it doesn’t work the first time, try it again until it works. It took three resets for our screen to start working again.","name":"SLIDE TO UPDATE PROBLEM?","description":"As for the other issue, we were able to fix the issue simply by unplugging our phone from the computer and iTunes. This isn’t a guaranteed fix but it worked for us and it’s a simple solution to try if you’re unable to do anything when presented with a “Slide to Update” option. If that doesn’t work, you’ll want to take a look at Apple’s list of official fixes for the well known iOS 9 issue."},{"body":"If they don’t, take a look at our list of iOS 9 battery life fixes and tipsthat will help you fix bad iOS 9.0, iOS 9.1 or iOS 9.2 battery life.\niPhone 6s Battery Percentage Issue\nApple’s outlined an iPhone 6s iOS 9 battery percentage issue on its website, an issue that we came across during our time at CES 2016 in Las Vegas. Here’s how the company describes this rather widespread issue with iOS 9.2:If you change the time on your iPhone 6s or iPhone 6s Plus manually or change time zones when traveling, you might notice that the battery percentage doesn’t update.\nIf this happens on your iPhone 6s or iPhone 6s Plus, there is a workaround. Apple’s temporary solution looks like this:\n1. Restart your iPhone.\n2. Go to Settings > General > Date & Time and make sure that Set Automatically is turned on. Learn more about the date and time on your device.\nIf that doesn’t help, contact Apple support. Apple says that it’s “aware of this issue and is investigating the cause and a solution.”\nWith iOS 9.2.1 and iOS 9.3 updates on the way, we could see a fix on board one of those.","name":"IOS 9 BATTERY LIFE PROBLEMS?","description":"The iOS 9 update brings a tangible battery life boost to the iPhone. Some users might get up to an extra hour of battery life. While some users are seeing an increase, others are noticing abnormal battery drain on their device. Battery issues are common, particularly right after a major system update like iOS 9. If your iOS 9 battery life isn’t what you think it should be after installing iOS 9.2, wait a couple of days for the update to settle. Things tend to improve after two days or so."},{"body":"If you run into Wi-Fi problems on iOS 9, you’ll want to reset your Network Settings. To do this, head into Settings > General > Reset > Reset Network Settings. This process can take a few minutes to complete and after it’s done, your device will have forgotten known Wi-Fi passwords so make sure you have your password handy.\nIf that doesn’t solve your issue, forget your Wi-Fi networks and reconnect to them. To get that done, go into your Settings > Wi-Fi > Select your connection > Tap Forget this Network at the top of the screen. Reconnect if you can.\nIf those fixes don’t work, take a close look at your router. We recommend unplugging it for a good minute or so then plugging it back in. If that doesn’t help, see if there is a firmware update for your router. Each router is different so you’ll need to consult your manual on how to do this.\nIf none of these fixes work for you, you can head here for some other potential fixes. Apple’s also got its own guide available as well.","name":"IOS 9 WI-FI PROBLEMS?","description":"We’re already seeing complaints about broken Wi-Fi in iOS 9. This isn’t at all surprising given that Wi-Fi problems are among the most common iOS problems. Fortunately, there are some proven fixes that could help you alleviate your iOS 9 Wi-Fi issues."},{"body":"These issues might require a direct fix from Apple but there are some things you can try if Touch ID starts acting up.","name":"IOS 9.1 TOUCH ID PROBLEMS?","description":"Many iOS 9.1 users are complaining about issues with Touch ID. Some are saying that the update has caused problems with accuracy while others are saying that their fingerprints no longer work to open up their device."},{"body":"Next. go to Settings > Touch ID & Passcode > Enter your Passcode. On the next screen swipe from right to left on each fingerprint to delete them. When this is complete you can tap on Add a Fingerprint… to re-train Touch ID.","name":"TOUCH ID FAILURES?","description":"If Touch ID suddenly stops working, try re-training your fingerprints. Before doing this you’ll want to make sure you that dirt and sweat are removed from the Touch ID sensor and that oil is removed from your hands."},{"body":"","name":"TOUCH ID PROBLEMS IN APP STORE?","description":"If you’re unable to use Touch ID in the App Store, try this fix. First go to Settings > Touch ID & Passcode > Enter your Passcode. Then turn off iTunes & App Store. Reboot your iPhone or iPad. Go back to Touch ID & Passcode in Settings and turn iTunes & App Store back on."},{"body":"If that doesn’t work, you might want to try a factory reset as this has been known to dislodge major Touch ID problems. The instructions can be found at the bottom of this page.","name":"TOUCH ID IF IT’S NOT WORKING AT ALL","description":"If it stops working, try resetting the phone by holding down the home button and the power button for 10 seconds or until the phone restarts."},{"body":"This is another common iOS problem and one that should affect various iOS 9 users in the weeks to come. Cellular data issues can be tricky but there are a few known fixes for them.\nIf you’re sure that these issues don’t have anything to do with an outage, either at Apple or device’s service provider, you’ll want to first try restarting your device. Power it down, slide to turn it off, and reboot it. It’s simple but it has squashed cellular issues in the past.\nIf that restart doesn’t help, try toggling Cellular Data off and on in your device’s Settings. To do that go into Settings > Cellular > Cellular Data > Toggle Off. After you toggle it off, toggle it back on and see if that doesn’t help.\nIf that doesn’t work, try flipping Airplane Mode on for 30 seconds before turning it back off again. Airplane Mode kills all connections on your device. The Airplane Mode function can be found at the top of your Settings\nIf the problem is with LTE, try shutting LTE off for a few minutes. To shut it down, go into Settings > Cellular > Enable LTE > Off. Flip it back on when ready.","name":"How to Fix iOS 9 Data Problems?","description":"We’re also seeing iOS 9 users complain about issues with cellular data. We’ve seen the list of complaints grow after the iOS 9.2 roll out."},{"body":"The first thing you’ll want to do is reset your device’s Network Settings. To get that done go to Settings > General > Reset > Reset Network Settings. Your device will forget the Bluetooth device and you’ll now have to reconnect.\nIf that doesn’t dislodge your problem, you’ll want to try forgetting the Bluetooth connection. To do that go to Settings > Bluetooth > Select your connection using the circular blue i tab > Tap Forget this Device. Try reconnecting.\nYou can also try resetting all of your settings. This has worked for us in the past and there’s a chance it will work for you. To reset all of your settings go to Settings > General > Reset > Reset All Settings. This process could take a few minutes and after it’s done, your device’s settings will be restored to factory defaults. In other words, have your Wi-Fi passwords handy.\nIf you are seeing Bluetooth problems in the car, you’ll want to consult your car’s manual so that you can restart the connection. This could be a little time consuming for some of you so make sure you set aside some quiet time to do it.\nForget the connection and then try reconnecting to the car. If that doesn’t help, you might want to try bringing it into a dealer or car specialist to take a look.","name":"IOS 9 BLUETOOTH PROBLEMS?","description":"Bluetooth issues are among the most common iOS problems andwe’re not surprised to see them affecting iOS 9 users after the iOS 9.1 and iOS 9.2 releases. Like cellular data problems, these can be a little tricky to fix because of the sheer number of Bluetooth devices out there. Here are a few things to try."},{"body":"First, see if there is a recent update for your app. Developers have been rolling out iOS 9 support updates that could help. We’ve downloaded a number of them and we haven’t run into any major problems with our apps. Make sure you read reviews on the App Store first though.\nIf that doesn’t work, try reinstalling the application. This has worked for us and many others in the past and it’s worth a shot. Make sure your data is backed up before you do this though.\nIf that doesn’t work, contact the developer and tell them about your problem so that they can address it in a future update.","name":"IOS 9 APP PROBLEMS?","description":"If you’re running into issues with third-party applications after installing iOS 9.2, you’ll want to try a few things before throwing your phone against a wall or deleting the app entirely."},{"body":"There are two known fixes for the problem though they aren’t guaranteed to work for you. The first requires a reset. To do this, hold down the power button and home button. Users are saying that got rid of the issue.\nOthers are saying that they’ve been able to rapidly tap “Update” on an app before the “Open” symbol appears. Some have said that they’ve had to tap upwards of 10 times for it to work but that it worked in the long run.\nWe’ve also seen this issue on older iOS updates and the issue simply went away after a short period of time. So if nothing works, be patient.","name":"How to Fix iOS 9 App Store Problems?","description":"We’ve been seeing complaints about problems with the App Store and downloading. This is obviously a big problem and it’s one that appears to be affecting iOS 9.0, iOS 9.1 and iOS 9.2 users as well."},{"body":"","name":"HOW TO IMPROVE IOS 9 PERFORMANCE?","description":"If you are dealing with performance issues like lag, you’ll want to consult our list of tips to improve the fluidity of iOS. These strategies are aimed at the iPhone 4s but they should come in handy across all iOS 9 powered devices."},{"body":"If you’re seeing problems with Messages, the first thing you’ll want to do is toggle the feature off and on again.\nGo into your Settings > Messages > Toggle iMessage off then back on. This fix has worked for us in the past and it’s the first thing you’ll want to try out.\nIf that quick fix doesn’t work, reboot your device.\nAnd if a reboot doesn’t work, head into your settings and reset Network Settings. Head into Settings > General > Reset > Reset Network Settings. This will cause your device to forget your connections so make sure you have your Wi-Fi passwords handy.","name":"IOS 9 IMESSAGE PROBLEMS?","description":"We’re also seeing problems with iMessage after the iOS 9.2 update. These are extremely common and we will almost certainly see iMessage problems continue well into iOS 9’s lifespan."}]