[{},{"body":"Workaround:\n* If you tap the power button twice the screen should blink back to life, but you may have to act quickly to end the call.\nPotential fixes:\n* This is likely to be an issue with the proximity sensor. Make sure that you don’t have a screen protector covering it. It’s located next to the front-facing camera at the top of the front face of the phone.\n* You should also make sure there’s no dirt covering it. Give it a wipe or try using compressed air on the top edge to blast any dust away.\n* Some people have reported success by pushing on the screen where the proximity sensor is located, which suggests a build issue.\n* You could ask for a replacement unit, although some people have encountered the same issue on more than one device.","name":"black screen during calls","description":"A lot of few people have encountered persistent problems with their screen going black whenever they make or receive a call on their Windows Phone 8 device. This makes it unresponsive, so it’s difficult to cancel or end the call. It seems to be a problem for the Lumia 920 specifically."},{"body":"Workarounds:\n* Try pressing and holding the camera button for a couple of seconds and see if that starts it.\n* Press and hold the volume down button and the power button together for 10 seconds. Your phone will restart and the camera should be working again, but the problem might reoccur.\nPotential fixes:\n* Make sure that your software is up to date; check your device manufacturer’s website.\n* Back up any important files and reset your phone via Settings > About > Reset your phone.\n* If the problem persists then it’s time to talk to your retailer, carrier, or manufacturer about a replacement handset.","name":"camera not working","description":"Some people have had problems with their camera on their Windows Phone 8 device. In some cases the camera button and camera app icon simply don’t seem to trigger anything. In other cases, a message will appear about the camera failing to initialize."},{"body":"Workaround:\n* A few people have found that turning off Xbox Music cloud collection helps. Go to Start > Music + Videos > More > Settings and turn off Xbox Music cloud collection.\nPotential fix:\n1. Make sure that you have a complete back up of your music collection.\n2. Now delete all of the music on your phone and on your SD card.\n3. Make sure that you back up anything precious on your phone and reset it via Settings > About > Reset your phone.\n4. Put the SD card into your PC and reformat it.\n5. Create a folder called Music on the blank card and manually drag and drop all the music you want into that folder.\n6. Now put the SD card back into your phone and wait for it to update.\n7. When you want to add new tracks take the SD card out of the phone and put it in your computer and drag and drop the new track into the folder, then put the card back in your phone.","name":"duplicate songs","description":"A lot of people have run into issues with their music collections on Windows Phone 8 devices. Sometimes songs appear twice or even three times. If you look in the folder on your phone there will only be one track, but in the music app you’ll see multiple copies. Unfortunately this can be a tricky problem to solve."},{"body":"Potential solutions:\n* Microsoft’s GDR2 update addresses this bug. The “other” category will still fill up, but it should be automatically cleared out when the storage reaches capacity.\n* Nokia released a Storage Check tool which can help you gain an insight into what is eating up space and clear away temporary files.\n* There is also a free app called Shrink Storage which enables you to fill your storage and then restart your device and trigger the clear up to empty it out.","name":"‘other’ storage filling up","description":"A lot of people suffer from a flaw in the WP8 system which caused the available storage to gradually fill up. Go into Settings > Phone storage and tap on the bar to get a breakdown of categories and see how much space your music and videos, pictures, apps, and system are taking up. There’s also an ‘other’ category which covers attachments from emails, app & game data, and other temporary files. Unfortunately, this category fills up and there is no way of clearing it out without wiping the phone. Microsoft has finally addressed the issue and there are a couple of other ways round it."},{"body":"Workaround:\n* Try restarting your device by holding down the Power button for 10 seconds then tapping to turn it on again.\nPotential solutions:\n* Check your Wi-Fi or data connection. Poor coverage will impact on push notifications. Go to Settings > Wi-Fi > Advanced and tick the box next to Keep WiFi on when screen times out.\n* Go to Settings and make sure that Battery saver isn’t turned on as it can disconnect you in order to save power.\n* If you are using your network, then make sure that your data limit hasn’t been exceeded. You should also check your limits in the Data Sense app and make sure it isn’t restricting you.\n* Uninstall the app you are having a problem with, restart your device, then reinstall the app to see if that helps.\n* Some people reported success by turning Location and Find my phone in Settings off or on and then restarting the device.","name":"push notifications not working","description":"It’s fairly common to encounter issues with push notifications. Sometimes updates do not come through to your device like they should. This can result in issues with apps like Facebook or WhatsApp where no notifications come through, but when you open the app there are a ton of updates queued up. Many Windows Phone 8 users have been complaining about push notifications not working properly on the platform with a number of popular apps. There are some things you can try."},{"body":"Workarounds:\n* Restart the device. Press and hold the power button for 10 seconds and then tap it to turn the phone back on. The problem should be temporarily gone.\n* If you own a Lumia device, use the Nokia Music app instead. It doesn’t appear to suffer from the volume issue.\n* Low volume that won’t change is generally associated with a specific app, use an alternative and you shouldn’t have the same problem.","name":"volume won’t change","description":"There have been a lot of reports about people listening to music and finding that they are unable to change the volume using the volume buttons during a specific track – the volume doesn’t change until the track has ended. This bug also impacts ringtones, which no longer fade the music in and out when a call comes in. Some users also report generally low volume which they are unable to increase."},{"body":"Solutions:\n1. Microsoft investigated and then released an OTA update in North America in December, known as ‘Portico,’ which fixed the random rebooting issue (this is still rolling out to other markets). To make sure you have the latest update go to App list > Settings > Phone update > Check for updates and follow the prompts.\n2. Some users reported the issue persisting, even after the update. It’s always worth trying a restart. Press and hold the Power button and then slide down when you see Slide down to power off. Turn it back on again and see if the problem repeats. You could also try removing the battery and replacing it.\n3. Your final option is to try a factory reset. Make sure you backup first by going to App list > Settings > Backup and choose App list + settings and then Back up now. Then go to About > Reset your phone and tap Yes and Yes again when prompted.","name":"random rebooting","description":"Toward the end of last year a number of WP8 users began to complain about random rebooting. The issue seemed to be common on the HTC 8X and Nokia Lumia 920, although it didn’t affect every handset. The smartphones would simply reboot without warning. There was also some suggestion that a syncing problem was related."},{"body":"Workarounds:\n1. You could disable auto-brightness and set the phone to Medium brightness just to prevent it from changing repeatedly.\n2. Some users reported success, or at least a reduced fluctuation, by turning on the phone in a completely dark environment and allowing the sensors to calibrate to the darkness.","name":"auto-brightness bug","description":"A number of WP8 users with Nokia Lumia 920 handsets reported wildly fluctuating screen brightness, possibly due to the Portico update. It seems a bug may have been introduced that impacts on the auto-brightness and causes the screen to flicker as it struggles to find the right brightness setting."},{"body":"Potential solutions:\n1. Press and hold the Volume down and the Power button simultaneously for 10 seconds. Your device should restart and work as normal.\n2. If the problem persists, check that you have the latest updates via App list > Settings > Phone update > Check for updates.\nWorkaround:\n1. Some people have reported that turning Wi-Fi off solves the freezing problem, but obviously it also deprives you of Wi-Fi, which is no good as a long-term fix.","name":"screen freezing","description":"If you find your WP8 device just freezes and the touchscreen is unresponsive then you are not alone. This issue could have various causes, but the methods to fix it are the same."},{"body":"Potential solutions:\n1. Try uninstalling and reinstalling the Skype and Facebook apps. Some users have reported both apps as major battery hogs, but insist that uninstalling and reinstalling results in improved performance.\n2. A number of apps have been cited as potential drains including Nokia Drive Beta, various messenger and music apps, and even some games. Nokia advised people to exit apps using the back button so that they close rather than continue to run in the background. You can also go to Settings > Applications > Background tasks and block any apps you don’t want running in the background.","name":"fast battery drain","description":"Some users have complained that their WP8 device is running out of battery juice very quickly. This could be caused by poorly optimized apps, syncing problems, or something else entirely. There are a few things worth trying to see if you can solve the issue. Obviously turning off NFC, Wi-Fi, mobile data, and other phone features when they aren’t needed is a good start."}]